# -*- coding: utf-8 -*-
"""
Задание 6.2a

Сделать копию скрипта задания 6.2.

Добавить проверку введенного IP-адреса.
Адрес считается корректно заданным, если он:
   - состоит из 4 чисел (а не букв или других символов)
   - числа разделенны точкой
   - каждое число в диапазоне от 0 до 255

Если адрес задан неправильно, выводить сообщение: 'Неправильный IP-адрес'

Сообщение "Неправильный IP-адрес" должно выводиться только один раз,
даже если несколько пунктов выше не выполнены.

Ограничение: Все задания надо выполнять используя только пройденные темы.
"""
ip: str = input("Введите ip адресс: ")

octets = ip.split(".")
valid_ip = len(octets) == 4 and ip.count('.') == 3

for i in octets:
    valid_ip = i.isdigit() and int(i) in range(256) and valid_ip

    
if valid_ip:
        if int(ip.split('.')[0]) in range(1, 224):
                print('unicast')
        elif int(ip.split('.')[0]) in range(224, 240):
                print('multicast')
        elif ip == '255.255.255.255':
                print('local broadcast')
        elif ip == '0.0.0.0':
                print('unassigned')
        else:
                print('unused')        
else:
       print('Неправильный IP-адрес')